Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ПРС_ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеВидыКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Приоритет = 99;


	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ПРС_ОбновлениеИнформационнойБазы.ОбновитьИспользованиеКонтактнойИнформации";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;

КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт

	// Справочник "Сотрудники"

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника;
	//ПараметрыВида.Подсказка = НСтр("ru='Телефон клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);


	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailСотрудника;
	//ПараметрыВида.Подсказка = НСтр("ru='Адрес электронной почты клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	// Справочник "Клиенты"

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента;
	//ПараметрыВида.Подсказка = НСтр("ru='Телефон клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);


	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКлиента;
	//ПараметрыВида.Подсказка = НСтр("ru='Адрес электронной почты клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

    // Справочник "Контактные лица"

	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	//ПараметрыВида.Подсказка = НСтр("ru='Телефон клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 1;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);


	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	//ПараметрыВида.Подсказка = НСтр("ru='Адрес электронной почты клиента'");
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 2;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);    
	
КонецПроцедуры        

Процедура ОбновитьИспользованиеКонтактнойИнформации() Экспорт

	// Начальная инициализация константы

	Константы.УчетСотрудников.Установить(Истина);
	КонтактыСотрудников = Справочники.ВидыКонтактнойИнформации.СправочникСотрудники.ПолучитьОбъект();
	КонтактыСотрудников.Используется = ПолучитьФункциональнуюОпцию("УчетСотрудников");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактыСотрудников);
	
	Константы.УчетКлиентов.Установить(Истина);
	КонтактыКлиентов = Справочники.ВидыКонтактнойИнформации.СправочникКлиенты.ПолучитьОбъект();
	КонтактыКлиентов.Используется = ПолучитьФункциональнуюОпцию("УчетКлиентов");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактыКлиентов);

	Константы.УчетКонтактныхЛиц.Установить(Истина);
	КонтактыКонтактныхЛиц = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица.ПолучитьОбъект();
	КонтактыКонтактныхЛиц.Используется = ПолучитьФункциональнуюОпцию("УчетКонтактныхЛиц");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(КонтактыКонтактныхЛиц);  
	
КонецПроцедуры