Функция ОчиститьКаталог(ПутьККаталогу) Экспорт
	
	МассивФайлов = НайтиФайлы(ПутьККаталогу, "*");
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ПутьККаталогу, "*");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки
	
КонецФункции

Функция ВыбратьКаталог(Заголовок, Каталог) Экспорт
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = Заголовок;
	Диалог.Каталог = Каталог;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
	КонецЕсли;
	Возврат Каталог;
	
КонецФункции
