&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	
	Перем ВыбранноеИмя,АдресВременногоХранилища;
	Если ПоместитьФайл(АдресВременногоХранилища, "", ВыбранноеИмя, Истина, УникальныйИдентификатор) Тогда
		АдресКартинки = АдресВременногоХранилища;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Картинка");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		УдалитьИзВременногоХранилища(АдресКартинки);
	КонецЕсли;	
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Картинка");

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НоваяКартинкаЭлемента");
КонецПроцедуры

&НаКлиенте
Процедура Комментарий(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Комментарий", Объект.Комментарий);
	Структура.Вставить("ТекущийВопрос", Объект.Ссылка);
	Текст = ОткрытьФормуМодально("Справочник.Вопросы.Форма.ФормаКомментарий", Структура);
	//ЭтаФорма.Модифицированность = ?(ПризнакЗакрытия=Неопределено,Ложь,ПризнакЗакрытия);
	Если НЕ ПустаяСтрока(Текст) Тогда
		
		ЭтаФорма.ОбновитьОтображениеДанных();
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Вопрос " + СокрЛП(Строка(Объект.Код)) + ": "+ Текст;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
