
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ОтборКомпоновки = Список.Отбор;
	//
	//ОтборПоТеме = ОтборКомпоновки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоТеме.Использование = Ложь;
	//ОтборПоТеме.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	//ОтборПоТеме.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборПоТеме.ПравоеЗначение = ОтборОбъектТестирования;
	//
	//ОтборПоРазделу = ОтборКомпоновки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоРазделу.Использование = Ложь;
	//ОтборПоРазделу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Раздел");
	//ОтборПоРазделу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборПоРазделу.ПравоеЗначение = ОтборРаздел;
	
	ОтборОбъектТестирования = Справочники.ОбъектыТестирования.ERP2;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбъектТестированияПриИзменении(Элемент)
	ОтборКомпоновки = Список.Отбор;
	
	ОтборПоТеме = ОтборКомпоновки.Элементы[0];
	ОтборПоРазделу = ОтборКомпоновки.Элементы[1];
	ОтборПоРазделу.Использование = Ложь;
	
	Если ОтборОбъектТестирования.Пустая() Тогда
		ОтборПоТеме.Использование = Ложь;
	Иначе
		ОтборПоТеме.Использование = Истина;
		ОтборПоТеме.ПравоеЗначение = ОтборОбъектТестирования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборРазделПриИзменении(Элемент)
	ОтборКомпоновки = Список.Отбор;
	
	ОтборПоРазделу = ОтборКомпоновки.Элементы[1];
	Если ОтборРаздел.Пустая() Тогда
		ОтборПоРазделу.Использование = Ложь;
	Иначе
		ОтборПоРазделу.Использование = Истина;
		ОтборПоРазделу.ПравоеЗначение = ОтборРаздел;
    КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтборОбъектТестированияПриИзменении(Элементы.ОтборОбъектТестирования);
	
КонецПроцедуры
