Процедура СоздатьРазделы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Разделы.Ссылка
				   |ИЗ
				   |	Справочник.Разделы КАК Разделы";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Выборка = Справочники.ОбъектыТестирования.Выбрать();
		Пока Выборка.Следующий() Цикл
			Владелец = Выборка.Ссылка;
			Для Сч = 1 По 14 Цикл
				НовРаздел = Справочники.Разделы.СоздатьЭлемент();
				Если Сч <=9 Тогда
					НовРаздел.Код = "0" + Сч;
				Иначе
					НовРаздел.Код = "" + Сч;
				КонецЕсли;
				НовРаздел.Наименование = "Раздел " + НовРаздел.Код;
				НовРаздел.Владелец = Владелец;
				НовРаздел.Записать();
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьКаталогЙоксель() Экспорт
	
	Возврат Константы.КаталогYoksel.Получить();
	
КонецФункции

Функция УстановитьКаталогЙоксель(Каталог) Экспорт
	
	Константы.КаталогYoksel.Установить(Каталог);
	Возврат Константы.КаталогYoksel.Получить();
	
КонецФункции	

Функция ПолучитьОбщМакет(ИмяМакета) Экспорт
	
	Возврат ПолучитьОбщийМакет(ИмяМакета);
	
КонецФункции

Функция ПолучитьСписокОбъектовТестирования() Экспорт
			
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыТестирования.Ссылка
		               |ИЗ
		               |	Справочник.ОбъектыТестирования КАК ОбъектыТестирования
		               |ГДЕ
		               |	ОбъектыТестирования.Предопределенный
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОбъектыТестирования.Наименование";
		
		Выборка = Запрос.Выполнить().Выбрать();
		СЗ = Новый СписокЗначений;
	
		Пока Выборка.Следующий() Цикл
			ЭлементСписка = СЗ.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат СЗ;
		
КонецФункции	