
&НаКлиенте
Процедура СледующийВопрос(Команда)    
	ЗафиксироватьРезультат();  
	Объект.НаборТестов.Очистить();
	Объект.ВариантыОтветов.Очистить();
	СледующийВопросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьРезультат()
	
	Для каждого ТекущийВариант Из Объект.ВариантыОтветов Цикл
		Если ТекущийВариант.Ответ = Истина Тогда
			ВыбранныйВариантОтвета = ТекущийВариант.ВариантОтвета;
			Верно = ?(ПравильныйВариантОтвета=ВыбранныйВариантОтвета,Истина,Ложь);
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(ВыбранныйВариантОтвета) Тогда
		МЗ = РегистрыСведений.КартаЗнаний.СоздатьМенеджерЗаписи();
		МЗ.Сотрудник = Объект.Сотрудник;
		МЗ.КартаЗнаний = Объект.КартаЗнаний;
		МЗ.Вопрос = Вопрос;                    
		МЗ.УровеньВладения = ПолучитьСлучайноУровень();
		МЗ.Верно = Верно;
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры	                                       

Функция ПолучитьСлучайноУровень()
	ГСЧ = новый ГенераторСлучайныхЧисел;
	Слчисло = ГСЧ.СлучайноеЧисло(1,5);
	Если Слчисло = 1 Тогда 
		Возврат Перечисления.УровеньВладения.ГлубокиеЗнания;
	ИначеЕсли Слчисло = 2 Тогда 
		Возврат Перечисления.УровеньВладения.ЗнаюХорошо;
	ИначеЕсли Слчисло = 3 Тогда 
		Возврат Перечисления.УровеньВладения.ИмеюПредставление;
	ИначеЕсли Слчисло = 4 Тогда 
		Возврат Перечисления.УровеньВладения.Эксперт;
	ИначеЕсли Слчисло = 5 Тогда 
		Возврат Перечисления.УровеньВладения.НеЗнаю;
	КонецЕсли;		
КонецФункции
	
&НаСервере
Процедура СледующийВопросНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КартаЗнанийСпециалистаНаборВопросов.Вопрос КАК Вопрос
		|ИЗ
		|	Справочник.КартаЗнанийСпециалиста.НаборВопросов КАК КартаЗнанийСпециалистаНаборВопросов
		|ГДЕ
		|	КартаЗнанийСпециалистаНаборВопросов.Ссылка = &КартаЗнаний
		|	И КартаЗнанийСпециалистаНаборВопросов.Вопрос.Код > &КодПропуститьВопрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос";
		//|	И КартаЗнанийСпециалистаНаборВопросов.Вопрос.Код = &Код";
	Запрос.УстановитьПараметр("КартаЗнаний",Объект.КартаЗнаний); 
	Запрос.УстановитьПараметр("КодПропуститьВопрос",КодПропуститьВопрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВопросСтр = Объект.НаборТестов.Добавить();
			ВопросСтр.Вопрос = ВыборкаДетальныеЗаписи.Вопрос;
			Вопрос = ВопросСтр.Вопрос;       
			
		КонецЦикла;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВопросыВариантыОтветов.ВариантОтвета КАК ВариантОтвета,
			|	ВопросыВариантыОтветов.Правильный КАК Правильный
			|ИЗ
			|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
			|ГДЕ
			|	ВопросыВариантыОтветов.Ссылка = &Вопрос
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВариантОтвета"; 
		
		Запрос.УстановитьПараметр("Вопрос",Вопрос); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВопросСтр = Объект.ВариантыОтветов.Добавить();
			ВопросСтр.ВариантОтвета = ВыборкаДетальныеЗаписи.ВариантОтвета;   
			Если ВыборкаДетальныеЗаписи.Правильный = Истина Тогда
				  ПравильныйВариантОтвета = ВопросСтр.ВариантОтвета;      
				  Сообщить(ПравильныйВариантОтвета);
			КонецЕсли;
		КонецЦикла;   
			
		КодПропуститьВопрос = Вопрос.Код;
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Тестирование завершено!");
		Объект.НаборТестов.Очистить();
		Объект.ВариантыОтветов.Очистить();
		
    КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТестирование(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НачатьТестирование(Команда)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.КартаЗнаний) И ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.НаборТестов.Очистить();
		Объект.ВариантыОтветов.Очистить();  
		КодПропуститьВопрос = "";
		СледующийВопросНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Объект.Сотрудник = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыВыбора = Новый Структура;
	//ПараметрыВыбора.Вставить("ОтборПоСотруднику",Объект.КартаЗнаний);
	//ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",ПараметрыВыбора,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)         
	Объект.КартаЗнаний = СотрудникПриИзмененииНаСервере(Объект.Сотрудник);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПриИзмененииНаСервере(Сотрудник)
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Должность");
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность,"ПерсональнаяКартаЗнаний");
КонецФункции

