
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры
Процедура УстановитьОтбор()
	
	
	//ОтборПоВладельцу = ЭтаФорма.Список.Отбор.Элементы[0];
	//Если ЗначениеЗаполнено(ОтборОбъектТестирования) Тогда
	//	ОтборПоВладельцу.ВидСравнения = ВидСравнения.Равно;
	//	ОтборПоВладельцу.Значение = ОтборОбъектТестирования;
	//	ОтборПоВладельцу.Использование = Истина;	
	//Иначе
	//	ОтборПоВладельцу.Использование = Ложь;
	//КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	ОтборОбъектТестирования = Справочники.ОбъектыТестирования.ERP2;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	УстановитьОтбор();
КонецПроцедуры


&НаКлиенте
Процедура ОтборОбъектТестированияПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры
 