
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоСотруднику") Тогда  
		КартаЗнаний = Параметры.ОтборПоСотруднику;
		Должность = КартаЗнаний.Должность;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Должность");
    	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    	ЭлементОтбора.Использование = Истина;
    	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    	ЭлементОтбора.ПравоеЗначение = Должность;    
	КонецЕсли;
	
КонецПроцедуры
