&НаСервере
Функция ПолучитьМассивРазделовПоОбъектуТестирования(ОТ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
					|Разделы.Ссылка,
					|Разделы.Код КАК Код,
					|Разделы.Наименование,
					|ВложенныйЗапрос.Количество
					|ИЗ
					|	Справочник.Разделы КАК Разделы
					|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вопросы.Ссылка) КАК Количество,
					|			Вопросы.Раздел КАК Раздел,
					|			ПРЕДСТАВЛЕНИЕ(Вопросы.Раздел) КАК РазделПредставление
					|		ИЗ
					|			Справочник.Вопросы КАК Вопросы
					|		
					|		СГРУППИРОВАТЬ ПО
					|			Вопросы.Раздел) КАК ВложенныйЗапрос
					|		ПО Разделы.Ссылка = ВложенныйЗапрос.Раздел
					|ГДЕ
					|	Разделы.Владелец = &ОбъектТестирования
					|
					|УПОРЯДОЧИТЬ ПО
					|	Код";
	
	Запрос.УстановитьПараметр("ОбъектТестирования", ОТ);
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивРазделов = Новый Массив;
	МассивРазделов.Добавить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));	
	МассивРазделов.Добавить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество"));	
 
	Возврат МассивРазделов;
	
КонецФункции	

&НаКлиенте
Процедура ОбъектТестированияПриИзменении(Элемент)
	
	Объект.Разделы.Очистить();
	Если Объект.ОбъектТестирования.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделов = ПолучитьМассивРазделовПоОбъектуТестирования(Объект.ОбъектТестирования);
	//Для Сч = 0 По МассивРазделов.Количество() - 1 Цикл
	Для Сч = 0 По МассивРазделов[0].Количество() - 1 Цикл
		ЭлементСписка = Объект.Разделы.Добавить(МассивРазделов[0][Сч],Строка(МассивРазделов[0][Сч])+" ("+Строка(МассивРазделов[1][Сч])+")");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КоличествоВопросов = 14;
	Объект.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Объект.КонецПериода = НачалоМесяца(ТекущаяДата());
	Объект.ОбъектТестирования = Справочники.ОбъектыТестирования.ERP2;
		
КонецПроцедуры	

&НаКлиенте
Процедура НачатьТестирование(Команда)
	
	Если Объект.НачалоПериода > Объект.КонецПериода 
		Или (Не ЗначениеЗаполнено(Объект.НачалоПериода))
		Или (Не ЗначениеЗаполнено(Объект.КонецПериода)) Тогда
		Вопрос("Неправильно указан период!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектТестирования) Тогда
		Вопрос("Не выбран объект тестирования!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
		
	Если Объект.КоличествоВопросов = 0 Тогда
		Сообщить("Укажите количество вопросов, которые будут использованы в тестировании!");
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ОбъектТестирования", Объект.ОбъектТестирования);
	Структура.Вставить("ДатаНач", Объект.НачалоПериода);
	Структура.Вставить("ДатаКон", Объект.КонецПериода);
	Структура.Вставить("ЧислоВопросов", Объект.КоличествоВопросов);
	
	СписокНужныхРазделов = Новый СписокЗначений;
	Для Каждого Раздел Из Объект.Разделы Цикл
		Если Раздел.Пометка Тогда
			СписокНужныхРазделов.Добавить(Раздел.Значение);
		КонецЕсли;
	КонецЦикла;
	Структура.Вставить("Разделы", СписокНужныхРазделов);
	Структура.Вставить("ПоследовательноПоРазделам", Объект.ПоследовательноПоРазделам);
	Структура.Вставить("ПоследовательноПоВопросам", Объект.ПоследовательноПоВопросам);

	Структура.Вставить("ТолькоСложные", Объект.ТолькоСложные);
	
	ФормаЭлемента = ОткрытьФормуМодально("Обработка.Тестирование1СПрофессионал.Форма.ФормаТестирования", Структура,ЭтаФорма);
	Попытка
		Если ФормаЭлемента = 0 Тогда 
			Сообщить("По заданным параметрам тесты не найдены");
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбъектТестированияПриИзменении(Элементы.ОбъектТестирования);
КонецПроцедуры

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	ЕстьВыбранныеРазделы = Ложь;
	Для Каждого Раздел Из Объект.Разделы Цикл
		Если Раздел.Пометка Тогда
			ЕстьВыбранныеРазделы = Истина;
		КонецЕсли;
	КонецЦикла;

	Элементы.ПоследовательноПоРазделам.Доступность = ЕстьВыбранныеРазделы;
	
КонецПроцедуры

