
&НаКлиенте
Процедура ВыбратьСотрудника(Команда)
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ОтборПоСотруднику",Объект.КартаЗнаний);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора");

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
КонецПроцедуры

//&НаКлиенте
//Процедура СотрудникНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка  = Ложь;
//КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Объект.Сотрудник = ВыбранноеЗначение;
КонецПроцедуры
