&НаСервере
Функция ПолучитьМассивРазделовПоОбъектуТестирования(ОТ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Разделы.Ссылка,
	               |	Разделы.Код КАК Код,
	               |	Разделы.Наименование
	               |ИЗ
	               |	Справочник.Разделы КАК Разделы
	               |ГДЕ
	               |	Разделы.Владелец = &ОбъектТестирования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
				   
	Запрос.УстановитьПараметр("ОбъектТестирования", ОТ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

&НаКлиенте
Процедура ОбъектТестированияПриИзменении(Элемент)
	
	Отчет.Разделы.Очистить();
	Если Отчет.ОбъектТестирования.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделов = ПолучитьМассивРазделовПоОбъектуТестирования(Отчет.ОбъектТестирования);
	Для Сч = 0 По МассивРазделов.Количество() - 1 Цикл
		ЭлементСписка = Отчет.Разделы.Добавить(МассивРазделов[Сч]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ВыводПравильныхОтветов = 2;
	Отчет.НачалоПериода = НачалоМесяца(ТекущаяДата());
	Отчет.КонецПериода = НачалоМесяца(ТекущаяДата());
	Отчет.ОбъектТестирования = Справочники.ОбъектыТестирования.ERP2;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбъектТестированияПриИзменении(Элементы.ОбъектТестирования);
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Отчет.НачалоПериода > Отчет.КонецПериода тогда
		Вопрос("Неправильно указан период!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ОбъектТестирования) Тогда
		Вопрос("Укажите вид теста!", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	ТабДок = СформироватьОтчетНаСервере();
	Если Не ТабДок = Неопределено Тогда
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.Показать(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Возврат Отчеты.РаспечаткаТестов.Создать().СформироватьОтчет(Отчет.ОбъектТестирования, Отчет.Разделы, Отчет.НачалоПериода, Отчет.КонецПериода, Отчет.ВыводПравильныхОтветов);
	
КонецФункции


