
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",ложь);	
	ОткрытьФорму("Справочник.Компетенции.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Для каждого ТекЗначение из ВыбранноеЗначение Цикл 
		НовСтрока = Объект.ПотенциальныеКомпетенции.Добавить();
		НовСтрока.КомпетенцияДляРаботыССистемой = ТекЗначение;
	КонецЦикла;

КонецПроцедуры
