
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Стр Из Объект.Вопросы Цикл
		Стр.Выб = ИСТИНА;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	ТЧ = Объект.Вопросы;
	Для каждого Стр Из ТЧ Цикл
		Если Стр.Выб Тогда
			СсылкаНаЭлемент = Стр.Вопрос.Ссылка;
			ЭлементСпр = Справочники.Вопросы.НайтиПоКоду(СсылкаНаЭлемент.Код); //Выборка.Ссылка.ПолучитьОбъект();
			спрЭлемент = ЭлементСпр.ПолучитьОбъект();
			Сообщить ("Удален элемент: " + ЭлементСпр.Вопрос);
			СпрЭлемент.Удалить();
		КонецЕсли; 
	КонецЦикла; 
	ЗаполнитьВопросы();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Вы уверены, что хотите удалить эти вопросы из справочника?';"
	     + " en = 'Do you want to continue?'"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	Иначе
		УдалитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазделПриИзмененииНаСервере()
	ОбъектТестирования = Раздел.Владелец;
	ЗаполнитьВопросы();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделПриИзменении(Элемент)
	РазделПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьВопросы()
	Объект.Вопросы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Выб,
		|	Вопросы.Ссылка КАК Вопрос,
		|	Вопросы.Вопрос КАК ТекстВопроса
		|ИЗ
		|	Справочник.Вопросы КАК Вопросы
		|ГДЕ
		|	Вопросы.Владелец = &Владелец";
		Если ЗначениеЗаполнено(Раздел) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И Вопросы.Раздел = &Раздел";
		КонецЕсли;
	Запрос.УстановитьПараметр("Владелец", ОбъектТестирования);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	Объект.Вопросы.Загрузить(Выборка);
	
КонецПроцедуры

&НаСервере
Процедура ОбъектТестированияПриИзмененииНаСервере()
	ЗаполнитьВопросы();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТестированияПриИзменении(Элемент)
	ОбъектТестированияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого Стр Из Объект.Вопросы Цикл
		Стр.Выб = ЛОЖЬ;
	КонецЦикла; 
	
КонецПроцедуры
