Функция СформироватьРезультатТестированияНаСервере(ОбъектТестирования, мВопрос, мОтвет1, мОтвет2, мОтвет3, мОтвет4, мОтвет5, мОтвет6,
	                                      мПравильныйВариантОтвета, мКартинка, мРаздел, мНомерВопроса, мНомерОтвета, мСсылка) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РезультатТестирования";
	ШрифтЖирный = Новый Шрифт(,9,Истина);
	ЦветЗеленый 	= Новый Цвет(233,255,236);
	
	// Вывод заголовка
	Макет = ПолучитьМакет("РезультатТестирования");
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ВсегоВопросов = мВопрос.Количество();
	//Область.Параметры.ВсегоОтветов = мНомерВопроса.Количество();
	
	ЧислоПравильныхОтветов = 0;
	Для я = 0 По мНомерВопроса.Количество() - 1 Цикл
		Индекс = я;
		Если мНомерОтвета[Индекс] <> 1 и мНомерОтвета[Индекс] <> 2 и мНомерОтвета[Индекс] <> 3
			и мНомерОтвета[Индекс] <> 4 и мНомерОтвета[Индекс] <> 5 и мНомерОтвета[Индекс] <> 6 Тогда
			Продолжить;
		КонецЕсли;
		//ЧислоОтветов = ЧислоОтветов + 1;
		Если мНомерОтвета[Индекс] = мПравильныйВариантОтвета[Индекс] Тогда
			ЧислоПравильныхОтветов = ЧислоПравильныхОтветов + 1;
		КонецЕсли; 
		
	КонецЦикла;	
	Область.Параметры.ПравильныхОтветов = ЧислоПравильныхОтветов;
	Область.Параметры.Процентов = Окр(ЧислоПравильныхОтветов/Область.Параметры.ВсегоВопросов, 2, РежимОкругления.Окр15как20)*100;
	
	//Область.Параметры.Период = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецМесяца(КонецДня(КонецПериода)), "ФП = Истина");
	Область.Параметры.ОбъектТестирования = ОбъектТестирования;
	ТабДокумент.Вывести(Область);
	
	ОбластьВ = Макет.ПолучитьОбласть("Вопрос");
	ОбластьО = Макет.ПолучитьОбласть("Ответ");
	ОбластьД = Макет.ПолучитьОбласть("ПравильныйВдвойнеОтвет");
	ОбластьП = Макет.ПолучитьОбласть("ПравильныйОтвет");
	ОбластьН = Макет.ПолучитьОбласть("НеПравильныйОтвет");
	ОбластьК = Макет.ПолучитьОбласть("Рисунок");
	ОбластьНеВыбран = Макет.ПолучитьОбласть("ОтветНеВыбран");
	
	//ОтветДан = Ложь;
	Для Инд = 0 По мВопрос.Количество() - 1 Цикл
		ОбластьВ.Параметры.Ссылка = мСсылка[Инд];
		ОбластьВ.Параметры.Вопрос = мВопрос[Инд];
		ЗаголовокВопроса = "№ " + Строка(Инд+1) + ", " + ?(Не мРаздел[Инд].Пустая(),
		"Раздел: """ + мРаздел[Инд], "");
		ОбластьВ.Параметры.ЗаголовокВопроса = ЗаголовокВопроса;	
		ТабДокумент.Вывести(ОбластьВ);
		
		Для Ном = 1 По 6 Цикл	
		Если Ном = 1 Тогда мОтвет = мОтвет1 ИначеЕсли Ном = 2 Тогда мОтвет = мОтвет2 ИначеЕсли Ном = 3 Тогда мОтвет = мОтвет3
		ИначеЕсли Ном = 4 Тогда мОтвет = мОтвет4 ИначеЕсли Ном = 5 Тогда мОтвет = мОтвет5 ИначеЕсли Ном = 6 Тогда мОтвет = мОтвет6 КонецЕсли;	
		
		ЗначениеОтвета = мОтвет[Инд];
		
		// выводим только заполненные ответы
		Если ЗначениеЗаполнено(ЗначениеОтвета) Тогда
			
			Индексс = мНомерВопроса.Найти(Инд+1);
			НомерОтвета = ?(Индексс = Неопределено, 0, мНомерОтвета[Индексс]);
			
			Если (Ном = мПравильныйВариантОтвета[Инд]) И (Ном = НомерОтвета) Тогда
				ОтветДан = Истина;
				ОбластьД.Параметры.Ответ = ЗначениеОтвета;
				ТабДокумент.Вывести(ОбластьД);
			ИначеЕсли Ном = мПравильныйВариантОтвета[Инд] Тогда
				ОбластьП.Параметры.Ответ = ЗначениеОтвета;
				ТабДокумент.Вывести(ОбластьП);	
			ИначеЕсли Ном = НомерОтвета Тогда
				ОтветДан = Истина;
				ОбластьН.Параметры.Ответ = ЗначениеОтвета;
				ТабДокумент.Вывести(ОбластьН);
			Иначе
				ОбластьО.Параметры.Ответ = ЗначениеОтвета;
				ТабДокумент.Вывести(ОбластьО);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
		Картинка = мКартинка[Инд].Получить();
		Если ЗначениеЗаполнено(Картинка) Тогда
			ТестовыеКартинки = ТабДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Индекс = ТабДокумент.Рисунки.Индекс(ТестовыеКартинки);
			ТабДокумент.Вывести(ОбластьК);						
			Если ТипЗнч(Картинка) <> Тип("Картинка") Тогда
					ИмяФайла = КаталогВременныхФайлов() + ОбъектТестирования.Наименование + "_" + СокрЛП(Индекс); 
					Картинка.Записать(ИмяФайла); 
					Картинка = Новый Картинка(ИмяФайла);
			КонецЕсли;
			ТабДокумент.Рисунки[Индекс].Картинка = Картинка;
			ТабДокумент.Рисунки[Индекс].РазмерКартинки = РазмерКартинки.Пропорционально;
			ТабДокумент.Рисунки[Индекс].Расположить(ТабДокумент.Область("Картинка"));
		КонецЕсли;
		
		//Если Не ОтветДан Тогда
		//	ТабДокумент.Вывести(ОбластьНеВыбран);
		//КонецЕсли;	
КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 10;
	ТабДокумент.ПолеСлева               = 10;
	ТабДокумент.ПолеСнизу               = 10;
	ТабДокумент.ПолеСправа              = 10;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.Защита = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции	
	